//=============================================================================
//
// objモデル処理 [0bj.cpp]
// Author :
//
//=============================================================================
#pragma once



//*****************************************************************************
// マクロ定義
//*****************************************************************************
struct HOUSE
{
	XMFLOAT3		pos;		// ポリゴンの位置
	XMFLOAT3		rot;		// ポリゴンの向き(回転)
	XMFLOAT3		scl;		// ポリゴンの大きさ(スケール)

	DX11_MODEL		model;		// モデル情報
	bool			load;


	XMFLOAT4X4		mtxWorld;	// ワールドマトリックス
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitHouse(void);
void UninitHouse(void);
void UpdateHouse(void);
void DrawHouse(void);

